// 2. Есть массив строк, строки в массиве могут повторяться. Необходимо написать функцию, 
// которая принимает на входе массив строк, а возвращает объект, где ключом в этом объекте 
// будет строка из массива, а значением - сколько раз она повторялась в переданном массиве.

// Пример:
// var arr = ['Petya', 'str', 'Vasya', 'John', 'str'];
// после вызова функции с данным массивом должны получить следующий объект:
// {
//   'Petya': 1,
//   'str': 2,
//   'Vasya': 1,
//   'John': 1,
// }

var arr = ['Petya', 'str', 'Vasya', 'John', 'str'];

function returnObj(arr) {
    var obj = {};

    return obj;
}
returnObj();


