// // 4. Напишите функцию, принимающую на вход два массива чисел и возвращающую массив, состоящий из массивов. 
// Каждый элемент нового массива должен содержать в себе два числа — число из первого массива и число из второго. 
// Например:
// // var combinations = function(a, b) { … }; // ваша функция
// // combinations([1, 2, 3], [4, 5]); 
// // // => [[1, 4], [1, 5], [2, 4], [2, 5], [3, 4], [3, 5]];

// NOT READY!

// var combinations = function(a, b) {
//     var result = [];

// };

// combinations([1, 2, 3], [4, 5])
